{
  "meta": {
    "book_title": "שכר מצוה",
    "page_number": "כב",
    "page_side": "left",
    "chapter_context": "פרק ראשון",
    "continues_from": {
      "flag": true,
      "section_letter": "א",
      "level": "body_paragraph"
    },
    "continues_to": {
      "flag": true,
      "section_letter": "ה",
      "level": "makor"
    }
  },
  "data": [
    {
      "type": "continuation_fragment",
      "text": "א\"כ ראוי לקבל טוב ומכל מהבורא ב\"ה שרצונו להיטיב תמיד אם יהיה המקבל ראוי לקבל.",
      "source_ref": "דודאים בשדה ואתחנן"
    },
    {
      "type": "continuation_fragment",
      "text": "אם בחוקותי תלכו וגו' כי התורה מבטיחה יעודים גשמיים וכו' ונתתי גשמיכם בעתם, דהוא שכר גשמי, ומכ\"ש שכר רוחני שצפן לכם עד אין שיעור וכו' והכתוב מודיע לנו דאפילו שכר גשמי יהיה לנו ע\"י האמנה שאדם אוכל פירותיהן בעוה\"ז וכו'.",
      "source_ref": "עלים לתרופה, בשם ספר רביד הזהב"
    },
    {
      "type": "continuation_fragment",
      "text": "שההולך בדרך חיים דהיינו דרך התוה\"ק אשר היא חיינו ואורך ימינו זוכה גם אל הטוב, שיהיה לו כל טוב גם בעוה\"ז כי רק מחילתן יכולים הכל באופן שלו.",
      "source_ref": "בשבילי הישיבה - נצבים"
    },
    {
      "type": "grouping_header",
      "title": "על פרטים שבכל מצוה"
    },
    {
      "type": "section",
      "number": "ב",
      "title": "על קבלת התורה בכלליות",
      "paragraphs": [
        {
          "is_makor": true,
          "text": "אמנם יש שכר כולל על שקבלנו התורה על מנת לשומרה שהיה העולם מתמוטט נמוגים ארץ וכל יושביה אם לא היה קבלת התורה וכו' וז\"ש היום לעשותן ומחר לקבל שכרן, וכי תאמרו מה נאכל בימי חלדינו, לזה אמר והיה עקב תשמעון את המשפטים האלה, ושמרתם כלומר שמיעה על מנת לעשות, דהיינו קבלת התורה, זה השכר הכולל שבזה קיימתם העולם זה יועיל אשר יזכור את בריתו וחסדך וכו'.",
          "source_ref": "פני דוד פ' עקב"
        }
      ]
    },
    {
      "type": "section",
      "number": "ג",
      "title": "על כללות קיום המצות",
      "paragraphs": [
        {
          "is_makor": true,
          "text": "וזהו השכר מצוה בהאי עלמא הנז' בתורה כ\"פ מכל שמיעת המצות ולהקמתו ועשותו וכו'.",
          "source_ref": "צדקת הצדיק"
        }
      ]
    },
    {
      "type": "section",
      "number": "ד",
      "title": "על הטוב המסתעף מהמצוה",
      "paragraphs": [
        {
          "is_makor": true,
          "text": "כי על המצוה נעלמה אין שכר אבל על מה שמסתעף מהמצוה יש שכר גם בהאי עלמא.",
          "source_ref": "מהרי\"ד מבעלזא"
        }
      ]
    },
    {
      "type": "section",
      "number": "ה",
      "title": "על מה שבעשיית מצוה ניתוסף יראת שמים",
      "paragraphs": [
        {
          "is_makor": true,
          "text": "דהנה אף דשכר מצוה בהאי עלמא ליכא, אבל בכל זאת נוטל שכר מן המצוה, משום דבעבור יראת השי\"ת משלם בהאי עלמא, דכל העולם כולו אינו ניזון אלא בשכר האמונה, וככל מצוה אשר יעשה לשם שמים בודאי על הפעולה גופא שכרה בהאי עלמא ליכא, אבל הרי בכל עשיית המצוה הוא מוסיף יראת ה' וקונה יראת ה', דע\"י עצם עשיית המצוה",
          "source_ref": null
        }
      ]
    }
  ]
}